# Load and connect to MySQL database

In [3]:
%load_ext sql

In [4]:
%sql mysql+pymysql://root:reneiloe1976!!!@127.0.0.1:3306/md_water_services

'Connected: root@md_water_services'

# 1. Cleaning our data

## Add email addresses to db using employee names, create new column to test out change

In [3]:
%%sql
SELECT 
    CONCAT(LOWER(REPLACE(employee_name, ' ', '.')),
            '@ndogowater.gov') AS new_email  # add it all together
FROM
    employee
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',)]

## Update employee table with emails

In [5]:
%%sql
UPDATE employee 
SET 
    email = CONCAT(LOWER(REPLACE(employee_name, ' ', '.')),
            '@ndogowater.gov');

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
56 rows affected.
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'print(employee)' at line 1")
[SQL: print(employee)]
(Background on this error at: http://sqlalche.me/e/14/f405)

## Count length of phone number string - should return 12

In [5]:
%%sql
SELECT 
    LENGTH(phone_number) AS phone_string_len
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[(12,), (12,), (12,), (12,), (12,)]

## Trim phone number length to get correct 12 count

In [14]:
%%sql
SELECT 
    TRIM(phone_number) AS new_phone_number
FROM
    employee 
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('+99637993287',),
 ('+99643864786',),
 ('+99222599041',),
 ('+99945849900',),
 ('+99381679640',)]

## Update new trimmed phone number

In [15]:
%%sql 
UPDATE employee 
SET 
    phone_number = TRIM(phone_number);

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
56 rows affected.

ResourceClosedError: This result object does not return rows. It has been closed automatically.

## Count length again to confirm that the length count is the correct 12

In [ ]:
%%sql
SELECT 
    LENGTH(phone_number)
FROM
    employee
LIMIT 5;

# 2. Honouring the workers

## Count number of employees in each town

In [16]:
%%sql 
SELECT 
    COUNT(assigned_employee_id) AS employee_count, town_name
FROM
    employee
GROUP BY town_name;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
9 rows affected.

[(3, 'Ilanga'),
 (29, 'Rural'),
 (4, 'Lusaka'),
 (4, 'Zanzibar'),
 (6, 'Dahabu'),
 (1, 'Kintampo'),
 (5, 'Harare'),
 (1, 'Yaounde'),
 (3, 'Serowe')]

## Count the number of visits made by each employee

In [17]:
%%sql 
SELECT 
    COUNT(visit_count) AS total_visits, assigned_employee_id
FROM
    visits
GROUP BY assigned_employee_id
ORDER BY COUNT(visit_count) DESC
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[(3708, 1), (3676, 30), (3539, 34)]

## Find out the contact details of employees that made the most visits

In [18]:
%%sql
SELECT 
    employee_name, email, phone_number
FROM
    employee
WHERE
    assigned_employee_id IN (1 , 30, 34);

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[('Bello Azibo', 'bello.azibo@ndogowater.gov', '+99643864786'),
 ('Pili Zola', 'pili.zola@ndogowater.gov', '+99822478933'),
 ('Rudo Imani', 'rudo.imani@ndogowater.gov', '+99046972648')]

# 3. Analysing locations

## Count the number of records (locations) per town

In [21]:
%%sql
SELECT 
    COUNT(location_id) AS records_per_town, town_name
FROM
    location
GROUP BY town_name
ORDER BY records_per_town DESC;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
25 rows affected.

[(23740, 'Rural'),
 (1650, 'Harare'),
 (1090, 'Amina'),
 (1070, 'Lusaka'),
 (990, 'Mrembo'),
 (930, 'Asmara'),
 (930, 'Dahabu'),
 (780, 'Kintampo'),
 (780, 'Ilanga'),
 (770, 'Isiqalo'),
 (750, 'Zuri'),
 (710, 'Amara'),
 (620, 'Majengo'),
 (520, 'Pwani'),
 (510, 'Kofi'),
 (480, 'Serowe'),
 (470, 'Bahari'),
 (460, 'Marang'),
 (400, 'Abidjan'),
 (400, 'Bello'),
 (370, 'Cheche'),
 (350, 'Deka'),
 (310, 'Djenne'),
 (300, 'Zanzibar'),
 (270, 'Yaounde')]

## Count the number of records (locations) per province

In [22]:
%%sql
SELECT 
    COUNT(location_id) AS records_per_province, province_name
FROM
    location
GROUP BY province_name
ORDER BY records_per_province DESC;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[(9510, 'Kilimani'),
 (8940, 'Akatsi'),
 (8220, 'Sokoto'),
 (6950, 'Amanzi'),
 (6030, 'Hawassa')]

## Create a result set showing:
### • province_name
### • town_name
### • An aggregated count of records for each town (consider naming this records_per_town).
### • Ensure your data is grouped by both province_name and town_name.
## Order your results primarily by province_name. Within each province, further sort the towns by their record counts in descending order.

In [23]:
%%sql
SELECT 
    province_name,
    town_name,
    COUNT(location_id) AS records_per_town
FROM
    location
GROUP BY province_name , town_name
ORDER BY province_name ASC , records_per_town DESC;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
31 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100),
 ('Amanzi', 'Asmara', 930),
 ('Amanzi', 'Dahabu', 930),
 ('Amanzi', 'Amina', 670),
 ('Amanzi', 'Pwani', 520),
 ('Amanzi', 'Abidjan', 400),
 ('Amanzi', 'Bello', 400),
 ('Hawassa', 'Rural', 3900),
 ('Hawassa', 'Serowe', 480),
 ('Hawassa', 'Amina', 420),
 ('Hawassa', 'Deka', 350),
 ('Hawassa', 'Djenne', 310),
 ('Hawassa', 'Zanzibar', 300),
 ('Hawassa', 'Yaounde', 270),
 ('Kilimani', 'Rural', 5440),
 ('Kilimani', 'Mrembo', 990),
 ('Kilimani', 'Harare', 850),
 ('Kilimani', 'Isiqalo', 770),
 ('Kilimani', 'Zuri', 750),
 ('Kilimani', 'Amara', 710),
 ('Sokoto', 'Rural', 5010),
 ('Sokoto', 'Ilanga', 780),
 ('Sokoto', 'Majengo', 620),
 ('Sokoto', 'Kofi', 510),
 ('Sokoto', 'Bahari', 470),
 ('Sokoto', 'Marang', 460),
 ('Sokoto', 'Cheche', 370)]

## Count number of sources per location type

In [24]:
%%sql
SELECT 
    COUNT(location_id) AS num_sources, location_type
FROM
    location
GROUP BY location_type;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
2 rows affected.

[(15910, 'Urban'), (23740, 'Rural')]

## What's the % of rural sources?

In [10]:
%sql SELECT ROUND((23740 / (15910 + 23740)) * 100) AS rural_sources_percent;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
1 rows affected.

[(Decimal('60'),)]

# 4. Diving into the sources

In [11]:
%%sql 
SELECT 
    *
FROM
    water_source
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486)]

## How many people did we survey in total?

In [12]:
%%sql 
SELECT 
    SUM(number_of_people_served) AS total_people_surveyed
FROM
    water_source;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

## How many wells, taps and rivers are there?

In [13]:
%%sql
SELECT 
    COUNT(source_id) AS num_sources, type_of_water_source
FROM
    water_source
GROUP BY type_of_water_source order by num;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[(7265, 'tap_in_home'),
 (5856, 'tap_in_home_broken'),
 (17383, 'well'),
 (5767, 'shared_tap'),
 (3379, 'river')]

In [ ]:
# How many people share particular types of water sources on average?

In [ ]:
%%sql
select round(avg(number_of_people_served),0) as avg_num_of_people_sharing, type_of_water_source
from water_source
group by type_of_water_source

In [ ]:
# 1 tap_in_home actually represents 644 ÷ 6 = ± 100 taps.

In [ ]:
# How many people are getting water from each type of source?

In [ ]:
%%sql
select sum(number_of_people_served) as total_num_of_people_sharing, type_of_water_source
from water_source
group by type_of_water_source
order by sum(number_of_people_served) desc

In [ ]:
# % people are getting water from each type of source?

In [ ]:
%%sql
select round(sum(number_of_people_served)/27628140*100) as total_num_of_people_sharing, type_of_water_source
from water_source
group by type_of_water_source
order by sum(number_of_people_served) desc

In [ ]:
# 43% of our people are using shared taps in their communities, and on average, we saw earlier, that 2000 people share one shared_tap.

# By adding tap_in_home and tap_in_home_broken together, we see that 31% of people have water infrastructure installed in their homes, but 45%
# (14/31) of these taps are not working! This isn't the tap itself that is broken, but rather the infrastructure like treatment plants, reservoirs, pipes, and
# pumps that serve these homes that are broken.
# 18% of people are using wells. But only 4916 out of 17383 are clean = 28% (from last week).

In [ ]:
# 5. Start of a solution

In [ ]:
# rank types of water sources by the number of people they serve

In [ ]:
%%sql
SELECT 
    type_of_water_source, 
    SUM(number_of_people_served) AS total_people_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS rank_by_people_served
FROM 
    water_source
GROUP BY 
    type_of_water_source;

In [ ]:
# rank types of water sources by the number of people they serve (excluding functioning inhome taps)

In [ ]:
%%sql
SELECT 
    type_of_water_source, 
    SUM(number_of_people_served) AS total_people_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS rank_by_people_served
FROM 
    water_source
where  type_of_water_source != 'tap_in_home'
GROUP BY 
    type_of_water_source;

In [ ]:
#ALTERNATIVE, problematic when there are a lot of categories
#%%sql
#SELECT 
#    type_of_water_source, 
#    SUM(number_of_people_served) AS total_people_served,
#    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS rank_by_people_served
#FROM 
#    water_source
#where  type_of_water_source in ('shared_tap', 'well', 'tap_in_home_broken', 'river')
#GROUP BY 
#    type_of_water_source;

In [ ]:
# rank types of water sources by the number of people they serve (excluding functioning inhome taps) 
# & prioritise the sources that need to be fixed within each source type

In [ ]:
%%sql
SELECT 
    type_of_water_source,
    source_id,
    number_of_people_served,
    RANK() OVER (PARTITION BY type_of_water_source ORDER BY number_of_people_served DESC) AS priority_rank
FROM 
    water_source
WHERE 
   type_of_water_source != 'tap_in_home'
ORDER BY 
    type_of_water_source, priority_rank desc;

In [ ]:
# 6. Analysing queues

In [ ]:
# How long did the survey take?

In [ ]:
%%sql
select 
min(time_of_record) as start_time, 
max(time_of_record) as end_time, 
datediff(max(time_of_record), min(time_of_record)) as length_of_survey_days 
from visits;

In [ ]:
# What is the average total queue time for water?

In [ ]:
%%sql
select round(avg(nullif(time_in_queue, 0))) as avg_queue_time_min
from visits;

In [ ]:
# What is the average queue time on different days?

In [ ]:
%%sql
SELECT 
    DAYNAME(time_of_record) AS day_of_week,
    round(avg(nullif(time_in_queue, 0))) AS avg_queue_time_min
FROM 
   visits
GROUP BY 
    DAYNAME(time_of_record)

In [ ]:
# What is the average queue time on different days & at different times?

In [ ]:
%%sql
SELECT 
    DAYNAME(time_of_record) AS day_of_week,
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    round(avg(nullif(time_in_queue, 0))) AS avg_queue_time_min
FROM 
   visits
GROUP BY 
    DAYNAME(time_of_record), TIME_FORMAT(TIME(time_of_record), '%H:00')

In [ ]:
# What is the average queue time at different times of the day?

In [ ]:
%%sql
SELECT 
    TIME_FORMAT(TIME(time_of_record), '%%:00') AS hour_of_day,
    round(avg(nullif(time_in_queue, 0))) AS avg_queue_time_min
FROM 
   visits
GROUP BY 
    TIME_FORMAT(TIME(time_of_record), '%%:00')

In [ ]:
# How can we communicate this information efficiently?

In [ ]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
DAYNAME(time_of_record),
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END AS Sunday
FROM
visits
WHERE
time_in_queue != 0

In [ ]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
-- Sunday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END
),0) AS Sunday,
-- Monday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday,
-- Tuesday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
ELSE NULL
END
),0) AS Tuesday,
-- Wednesday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
ELSE NULL
END
),0) AS Wednesday,
-- Thursday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
ELSE NULL
END
),0) AS Thursday,
-- Friday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
ELSE NULL
END
),0) AS Friday,
-- Saturday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
ELSE NULL
END
),0) AS Saturday
FROM
visits
WHERE
time_in_queue != 0 
GROUP BY
hour_of_day
ORDER BY
hour_of_day;

In [ ]:
# 7. Water Accessibility and infrastructure summary report
# This survey aimed to identify the water sources people use and determine both the total and average number of users for each source.
# Additionally, it examined the duration citizens typically spend in queues to access water.

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql